{
    "module": "keras",
    "class_name": "Sequential",
    "config": {
        "name": "sequential",
        "trainable": true,
        "dtype": "float32",
        "layers": [
            
            {
                "module": "keras.layers",
                "class_name": "InputLayer",
                "config": {
                    "batch_shape": [null, 50, 63],
                    "dtype": "float32",
                    "sparse": false,
                    "name": "input_layer"
                },
                "registered_name": null
            },

           
            {
                "module": "keras.layers",
                "class_name": "LSTM",
                "config": {
                    "name": "lstm",
                    "trainable": true,
                    "dtype": "float32",
                    "return_sequences": true,
                    "units": 64,
                    "activation": "relu",
                    "recurrent_activation": "sigmoid",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {"seed": null}
                    },
                    "recurrent_initializer": {
                        "module": "keras.initializers",
                        "class_name": "OrthogonalInitializer",
                        "config": {"gain": 1.0}
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "unit_forget_bias": true
                },
                "build_config": {"input_shape": [null, 50, 63]}
            },

            
            {
                "module": "keras.layers",
                "class_name": "LSTM",
                "config": {
                    "name": "lstm_1",
                    "trainable": true,
                    "dtype": "float32",
                    "return_sequences": true,
                    "units": 128,
                    "activation": "relu",
                    "recurrent_activation": "sigmoid",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {"seed": null}
                    },
                    "recurrent_initializer": {
                        "module": "keras.initializers",
                        "class_name": "OrthogonalInitializer",
                        "config": {"gain": 1.0}
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "unit_forget_bias": true
                },
                "build_config": {"input_shape": [null, 50, 64]}
            },

            
            {
                "module": "keras.layers",
                "class_name": "LSTM",
                "config": {
                    "name": "lstm_2",
                    "trainable": true,
                    "dtype": "float32",
                    "return_sequences": false,
                    "units": 64,
                    "activation": "relu",
                    "recurrent_activation": "sigmoid",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {"seed": null}
                    },
                    "recurrent_initializer": {
                        "module": "keras.initializers",
                        "class_name": "OrthogonalInitializer",
                        "config": {"gain": 1.0}
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "unit_forget_bias": true
                },
                "build_config": {"input_shape": [null, 50, 128]}
            },

            
            {
                "module": "keras.layers",
                "class_name": "Dense",
                "config": {
                    "name": "dense",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 64,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {"seed": null}
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {}
                    }
                },
                "build_config": {"input_shape": [null, 64]}
            },

            
            {
                "module": "keras.layers",
                "class_name": "Dense",
                "config": {
                    "name": "dense_1",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 32,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {"seed": null}
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {}
                    }
                },
                "build_config": {"input_shape": [null, 64]}
            },

           
            {
                "module": "keras.layers",
                "class_name": "Dense",
                "config": {
                    "name": "dense_2",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 26,
                    "activation": "softmax",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {"seed": null}
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {}
                    }
                },
                "build_config": {"input_shape": [null, 32]}
            }
        ],
        "build_input_shape": [null, 50, 63]
    },
    "compile_config": {
        "optimizer": "Adam",
        "loss": "categorical_crossentropy",
        "metrics": ["categorical_accuracy"],
        "steps_per_execution": 1
    }
}
